[{"id":1,"name":"GMMK 2","price":149.99,"description":"The GLORIOUS GMMK 2, also known as the GLORIOUS Modular Mechanical Keyboard 2, is a wired-only, mechanical keyboard available in a barebones version without switches or keycaps or a fully-assembled version with linear GLORIOUS Fox switches installed. It also comes in two different size variants, a 96% full-size and a 65% compact size. Like the other keyboards in GLORIOUS' GMMK lineup, this one is also hot-swappable, meaning you can change out the stock switches for any of your choosing without having to solder. In addition to its hot-swappable PCB, it also comes with screw-in stabilizers, so you can easily replace those.","quantity":200},{"id":2,"name":"GMMK PRO","price":349.99,"description":"Award-winning modular mechanical keyboard with enthusiast components and unmatched build quality. Fully customizable to your perfect look, sound, and feel. Specifications:\n\t• 75% Layout w/ 82 Keys\n\t• Fully Customizable Aesthetics\n\t• 5-Pin Hotswap Switch Support\n\t• CNC Machined Aluminum Body\n\t• Vibrant Per-Key RGB Illumination\n\t• Programmable Rotary Knob","quantity":400},{"id":3,"name":"TOFU60 2.0","price":159.0,"description":"Tofu60 was born in 2017 and has sold more than 40,000 units. It's a lot of people's first entry-level custom mechanical keyboard. Tofu60 2.0 is a new beginning, the new changes will bring a new typing experience, and the new surface coating process can also bring more color possibilities.","quantity":0},{"id":4,"name":"TOFU65 2.0","price":283.0,"description":"Tofu65 2.0 continues the design of the first generation. SICAs does upgrade the structure this time. The 2.0 version supports three different mounting styles: Top Mount, Gasket Mount, Silicone bowl Gasket mount (Available in 3 different hardness silicone bowl), which meant to provide three different typing experiences on one keyboard.","quantity":50},{"id":5,"name":"ODIN V2","price":410.0,"description":"The inspiration of the design is from the Stora Hammars I image stone which considers being Odin's cult symbol. Speak of Odin, who associates with wisdom, healing, death, royalty, the gallows, knowledge, war, battle, victory, sorcery, poetry, frenzy, and the runic alphabet, and projects him as the husband of the goddess Frigg. From SICA's point of view, the Odin means everything we wanted in a set of a keyboard with 100% layout!. Are you getting sick of the tiny layouts? Let's meet the Odin!","quantity":415},{"id":6,"name":"Tiger Lite","price":129.0,"description":"The SICAs Tiger Lite Mechanical Keyboard is a great entry level, hotswap TKL keyboard kit. Specifications:\n\t• Layout: 80%\n\t• PCB: Hotswapable, Flex Cut, 1.2 mm thickness, RGB underglow, QMK firmware, USB-C interface\n\t• Case: Top and Bottom ABS plastic\n\t• Plate: Polycarbonate\n\t• Structure: Leaf spring mount\n\t• Typing angle: 7°\n\t• Compatibility: MX-type switches\n\t• Keyboard Size: 358 x 134 x 31.9mm Front height 17.5mm\n\t• Tape Mod Size: 347 mm x 116 mm","quantity":314},{"id":7,"name":"LUNA 80","price":435.0,"description":"Luna is the goddess of the moon in Roman mythology. As the goddess of the moon, Luna symbolizes the sacredness and brilliance of the moon and represents the full side of the moon in the Trinity - the three phases of the Goddess, as opposed to Diana, the symbol of the full moon, and Proserpina, the symbol of the waning moon. It has been a long time since we designed a narrow-framed TKL before the birth of Luna. We shaped an elegant pose for her, and the interweaving of every line on Luna's body has been very carefully designed and refined. We have added new elements, some new ideas to Luna, and she will be a kit that has both an elegant look and a great input experience.","quantity":570},{"id":8,"name":"NK87 - Olive Edition","price":150.0,"description":"The NK87™ - Olive Edition is a TKL keyboard with a hotswap PCB designed to match Olive assembled with Nolives. Specifications: \n\t• Hotswap\n\t• VIA Compatible\n\t• USB C\n\t• TKL\n\t• Per switch RGB lighting (programmable via VIA)\n\t• CNC Aluminum Case\n\t• Coiled USB C cable included\n\t• NK_ Screw-in Stabilizers Installed\n\t• PCB/Plate Mount MX Switch Compatible (3 pin and 5 pin)\n\t• Thock Absorbers™- x8 Silicone strips between the plate and top case\n\t• Muffle Mats™ - x2 Silicone dampening pads One on the bottom, and one between the plate and PCB.\n\t• Nolive Switches included and installed","quantity":100},{"id":9,"name":"NK65 - Awaken Edition","price":240.0,"description":"The NK65™ - Awaken Edition is a standard 65% layout keyboard with a hotswap PCB. The PCB is VIA compatible with per switch RGB lighting. The switches are south facing. This will be fully assembled and comes with custom switches and keycaps. It includes a polycarbonate case, injection molded PC plate, PCB (same PCB as the NK65™ v2 - Aluminum Edition), NK_ plate mount stabilizers, and silicone dampening material. A carrying case is also included.","quantity":120},{"id":10,"name":"Matrix 8XV 3.0 Extras","price":670.0,"description":"This keyboard is in the WinKey layout with the upgraded full brass weight. It includes a soldered PCB. Specifications: \n\t• Keyboard case\n\t• Weight\n\t• Plate\n\t• PCB\n\t• 3 Position pins\n\t• USB type-c daughter board\n\t• Inner foam\n\t• 3mm poron foam\n\t• .5mm PE foam\n\t• 20 poron gaskets\n\t• Several cables\n\t• Several screws\n\t• Several extra bumpons\n\t• Eye Screen Part","quantity":500}]